#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-bhapHVcGky5E8dWQ

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/612.4c24fc5d.chunk.js"]: Refreshing state... [id=static/js/612.4c24fc5d.chunk.js]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js.map"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/616.be09603d.chunk.js.map"]: Refreshing state... [id=static/js/616.be09603d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.83ef46d4.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"]: Refreshing state... [id=static/css/main.61b89840.css.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/616.be09603d.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/616.be09603d.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/496.71d68e66.chunk.js"]: Refreshing state... [id=static/js/496.71d68e66.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js.map"]: Refreshing state... [id=static/js/main.83ef46d4.js.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js"]: Refreshing state... [id=static/js/main.83ef46d4.js]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"]: Refreshing state... [id=static/css/main.61b89840.css]
module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js.map"]: Refreshing state... [id=static/js/777.cf1c154f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/616.be09603d.chunk.js"]: Refreshing state... [id=static/js/616.be09603d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js"]: Refreshing state... [id=static/js/106.28d48f53.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.cf1c154f.chunk.js"]: Refreshing state... [id=static/js/777.cf1c154f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/612.4c24fc5d.chunk.js.map"]: Refreshing state... [id=static/js/612.4c24fc5d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/106.28d48f53.chunk.js.map"]: Refreshing state... [id=static/js/106.28d48f53.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/612.4c24fc5d.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/612.4c24fc5d.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js.map"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "6523465bc25bb2e1095ce728c816db64" -> "4249f734f6ed8e77bfa55de95eafd65d"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "J0OGagaJPqbSaUajSmq8xhiCqVZ2HPgJ" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "973fcbd5cde20f260e800a4f76194c79" -> "a27e1c4e4146c98fd00f940fc0c3d258"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "3JzxL9UFY8jxXXnG_8Qd7mrZhiidfulH" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.6d6f31e0.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "cd149b390d58e6ae8d25fae7f89508ae"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.6d6f31e0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.6d6f31e0.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.6d6f31e0.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "933d6083cca1ce7c64dbe0a1d0f38c5b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.6d6f31e0.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.6d6f31e0.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.6d6f31e0.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "f98532012f7b4c7432571367400f2b13"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.6d6f31e0.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.6d6f31e0.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js"] will be destroyed
  # (because key ["static/js/main.83ef46d4.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "fb4823d55b49eceb379f0997ba80a21e" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83ef46d4.js" -> null
      - key                    = "static/js/main.83ef46d4.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83ef46d4.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "KX1o_Poil9C5Fx4V4NTjIe0.RMKuFLxg" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.83ef46d4.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "933d6083cca1ce7c64dbe0a1d0f38c5b" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83ef46d4.js.LICENSE.txt" -> null
      - key                    = "static/js/main.83ef46d4.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83ef46d4.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "vv7jy3.K0k95sHJPtfdhMNSLAvFwtlyP" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83ef46d4.js.map"] will be destroyed
  # (because key ["static/js/main.83ef46d4.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "ff57b418c80e64d4fecc856c7d939929" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83ef46d4.js.map" -> null
      - key                    = "static/js/main.83ef46d4.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83ef46d4.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "GqhD6fUMETKNCtf8V8DsRb3byCTueBBq" -> null
    }

Plan: 3 to add, 2 to change, 3 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*